{
  "displayName": "ChronoShade",
  "description": "Cambia automáticamente entre temas claros y oscuros basándose en los horarios de amanecer/atardecer o horarios personalizados. Perfecto para desarrolladores que quieren que su editor se adapte a la iluminación natural durante el día. Disponible en 15 idiomas incluyendo inglés, chino, francés, alemán, italiano, español, japonés, coreano, portugués, turco, polaco, checo, húngaro y búlgaro.",
  "command.switchTheme": "ChronoShade: Cambiar Tema",
  "command.previewTheme": "ChronoShade: Vista Previa del Tema",
  "command.toggleSunset": "ChronoShade: Alternar Cambio Automático al Atardecer",
  "viewContainer.title": "ChronoShade",
  "view.name": "ChronoShade",
  "configuration.title": "Configuración de ChronoShade",
  "config.dayTheme": "Tema a aplicar durante el día.",
  "config.nightTheme": "Tema a aplicar durante la noche.",
  "config.manualSunset": "Establecer manualmente la hora del atardecer (formato 24 horas).",
  "config.manualSunrise": "Establecer manualmente la hora del amanecer (formato 24 horas).",
  "config.overrideThemeSwitch": "Habilitar o deshabilitar horarios personalizados de día/noche.",
  "config.useCronSchedule": "Usar expresiones cron en lugar de horarios fijos para alternar el tema día/noche.",
  "config.dayTimeStart": "Hora de inicio del día (formato 24 horas).",
  "config.nightTimeStart": "Hora de inicio de la noche (formato 24 horas).",
  "config.dayCronExpression": "Expresión cron que define cuándo cambiar al tema diurno.",
  "config.nightCronExpression": "Expresión cron que define cuándo cambiar al tema nocturno.",
  "config.useLocationBasedTimes": "Usar coordenadas GPS para determinar automáticamente los horarios de amanecer/atardecer en lugar de horarios manuales.",
  "config.latitude": "Su coordenada de latitud (para cálculo automático de amanecer/atardecer).",
  "config.longitude": "Su coordenada de longitud (para cálculo automático de amanecer/atardecer).",
  "config.sunriseOffset": "Desplazamiento en minutos añadido a la hora del amanecer (puede ser negativo).",
  "config.sunsetOffset": "Desplazamiento en minutos añadido a la hora del atardecer (puede ser negativo).",
  "config.systemThemeSync": "Seguir automáticamente los cambios de tema de color del sistema (modo Claro/Oscuro) para alternar entre los temas de Día y Noche configurados."
}